In [1]:
name = "Cobee"
name

'Cobee'

In [2]:
number = 4
number

4

# Machine Learning
There are 7 steps in machine learning :
- Collecting data
- Preparing data
- Choose a Model
- Training the Model
- Evaluating the Model
- Parameter Tuning
- Making prediction

In [4]:
import pandas as pd
data = [1,2,3]
df=pd.DataFrame(data)
df

#output: 0 is the column name since there is no name of column writen there

   0
0  1
1  2
2  3

In [8]:
student = [['Tom', 90], ['Jack', 80], ['Jill', 70]] #Create a 2D list for 2 Columns
data_student = pd.DataFrame(student, columns=['Name', 'Grade']) #'Name' , 'Grade' Is Column header
data_student

   Name  Grade
0   Tom     90
1  Jack     80
2  Jill     70

In [9]:
data_student['Name']

0     Tom
1    Jack
2    Jill
Name: Name, dtype: object

In [10]:
new_student = [['Sam', 60], ['Mary', 50], ['John', 40], ['Joseph', 30]]
new_student = pd.DataFrame(new_student, columns=['Name', 'Grade'])
data_student = pd.concat([data_student, new_student], ignore_index=True)#combine 2 dataframes 
data_student

     Name  Grade
0     Tom     90
1    Jack     80
2    Jill     70
3     Sam     60
4    Mary     50
5    John     40
6  Joseph     30

In [11]:
data_student.head(3)

   Name  Grade
0   Tom     90
1  Jack     80
2  Jill     70

In [12]:
data_student.tail(3)

     Name  Grade
4    Mary     50
5    John     40
6  Joseph     30

In [13]:
data_student.to_csv('data_student.csv')

In [14]:
person = [['Jhony', 'Swimming', 'male'], ['Catherine', 'Drawing', 'female'], ['Jack', 'Gaming', 'male']]
data_person = pd.DataFrame(person, columns=['Name', 'Hobby', 'Gender'])
data_person

        Name     Hobby  Gender
0      Jhony  Swimming    male
1  Catherine   Drawing  female
2       Jack    Gaming    male